app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "abdoulaye-theLinuxer"], ["LIMIT", 1]]
---
  def current_user
    User.find_by(username: session[:username])