app/controllers/followers_controller.rb

		def new
	@follower = current_user.followers.new(follower_id: params[:user_id])

      if @follower.save
---
INSERT INTO "followers" ("user_id", "follower_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["follower_id", 1], ["created_at", "2020-08-02 21:33:45.817676"], ["updated_at", "2020-08-02 21:33:45.817676"]]