app/controllers/hints_controller.rb

  def create
    @hint = current_user.hints.build(hint_params)

    respond_to do |format|
      if @hint.save
---
INSERT INTO "hints" ("text", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["text", "hhhhhhhhhhhhhhhh"], ["user_id", 3], ["created_at", "2020-08-02 20:48:36.711327"], ["updated_at", "2020-08-02 20:48:36.711327"]]