app/controllers/users_controller.rb

  def index
    all_user = User.all.order('created_at DESC')
    @users = User.where.not(id: [[current_user] + current_user.following])
    @hint = current_user.hints.build
    @hints = Hint.all.order('created_at DESC')
---
SELECT "users".* FROM "users"
SELECT "hints".* FROM "hints" ORDER BY created_at DESC

  def show
    @user_show = set_user
    @users = @user_show.followers
    @hints = @user_show.show_hints.order('created_at DESC')
---
SELECT "hints".* FROM "hints" WHERE "hints"."user_id" = $1 ORDER BY created_at DESC  [["user_id", 5]]

  def create
    @user = User.new(user_params)
    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("username", "fullname", "created_at", "updated_at", "image_file_name", "image_content_type", "image_file_size", "image_updated_at", "coverimage_file_name", "coverimage_content_type", "coverimage_file_size", "coverimage_updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"